backend/controllers/DokterUserController.php

INSERT INTO `dokter` (`NAMA_DOKTER`, `USERNAME`, `EMAIL`, `PASSWORD`, `STATUS_AKUN`, `STATUS`) VALUES ('raka', 'raka', 'raka@gmail.com', '123456', 10, 0)
---
    public function actionCreate()
    {
        $model = new DokterUser();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {