backend/controllers/UserManajemenController.php

    public function actionInactive($id = null)
    {
        if ($id != null){
            $model = $this->findModel($id);
            $model->status = 0;
            if ($model->save()){
                return $this->redirect(['index']);
            }else{
                print_r($model->getErrors());
            }
        }else{
            $model = $this->findModel(\Yii::$app->user->identity->id);
            $model->status = 0;
            $model->save();
---
SELECT * FROM `user` WHERE `id`='1'
UPDATE `user` SET `status`=10, `updated_at`=NOW() WHERE `id`=1