common/models/User.php

    public static function isUserAdmin($username)
    {
          if (static::findOne(['username' => $username, 'role' => self::ROLE_ADMIN])){
---
SELECT * FROM `user` WHERE (`username`='admin') AND (`role`=20)